Feature: Запазване на час

	Background: 
  	Given Човекът отваря екрана за запазване на час

  Scenario: Запазване на час като Потребител
    Given Потребителят е влязал в акаунта си
  	When Въведе име: "Анна-Мария"
  	And Въведе фамилия: "Димитрова"
  	And Въведе email: "annamariq@mail.bg"
  	And Въведе телефонен номер: "0878 595 877"
  	And Избере час: "15:30 12-05-2022"
  	And Натисне бутона за запазване на час
  	Then Вижда съобщение: "Часът е запазен успешно"


  Scenario Outline: Запазване на час като Гост
  	When Въведе име: "<Име>"
  	And Въведе фамилия: "<Фамилия>"
  	And Въведе email: "<Имейл>"
  	And Въведе телефонен номер: "<Телефонен номер>"
  	And Избере час: "<Час>"
  	And Натисне бутона за запазване на час
  	Then Вижда съобщение: "<Съобщение>"

		Examples:
      | Име          | Фамилия    | Имейл                | Телефонен номер    | Час               | Съобщение                                                          |
      | Димитър      | Тумбалов   |                      | 0878595877         | 14:00 12-05-2022  | Невалиден имейл адрес                                              |
      | О'Конъл      | Михайлов   | oc                   | 359878595877       | 14:00 12-05-2022  | Невалиден имейл адрес                                              |
      | Димитър      | Тумбалов   | dimitar@abv.bg       |                    | 14:00 12-05-2022  | Невалиден телефонен номер                                          |
      | Димитър      | Тумбалов   | dimitar@gmail.bg     | abv123             | 14:00 12-05-2022  | Невалиден телефонен номер                                          |
      |              | Тумбалов   | dimitar@gmail.bg     | +0878 595 877      | 14:00 12-05-2022  | Невалидно първо име                                                |
      | Димитър12    | Тумбалов   | dimitar@gmail.bg     | +359878595877      | 14:00 12-05-2022  | Невалидно първо име                                                |
      | Димитър      |            | dimitar@gmail.bg     | 0878595877         | 14:00 12-05-2022  | Невалидна фамилия                                                  |
      | Димитър      | Тумб567    | dimitar@gmail.bg     | +0878595877        | 14:00 12-05-2022  | Невалидна фамилия                                                  |
      | Анна-Мария   | Димитрова  | annamariq@mail.bg    | 0878595877         |                   | Невалиден час                                                      |
      | О'Конъл      | Михайлов   | oconnel@gmail.bg     | 359878 595 877     | 14:00 12-05-1022  | Невалиден час                                                      |
      | Анна-Мария   | Димитрова  | annamariq@mail.bg    | +0878-595-877      | 14:00 12-05-10000 | Невалиден час                                                      |
      | Анна-Мария   | Димитрова  | annamariq@mail.bg    | 0878595877         | 14:00 05-05-2022  | Часът е зает                                                       |
      | О'Конъл      | Михайлов   | oconnel@gmail.bg     | 0878595877         | 10:00 02-03-2022  | Кабинетът ще бъде затворен                                         |
      | Анна-Мария   | Димитрова  | annamariq@mail.bg    | 359878-595-877     | 12:30 12-05-2022  | Кабинетът няма да работи в този час                                |
      | Анна-Мария   | Димитрова  | annamariq@mail.bg    | 0878 595 877       | 15:00 12-05-2022  | Беше ви изпратен линк за потвърждение на часа на вашия имейл адрес |